.open marks.db

DROP TABLE IF EXISTS students;

CREATE TABLE students{
id INTEGER PRIMARY KEY,
name CHAR,
num_group INTEGER
};

CREATE TABLE labs{
id INTEGER PRIMARY KEY,
name_lab CHAR,
max_mark INTEGER,
deadline DATE,
num_group INTEGER
};

CREATE TABLE attendance{
id INTEGER PRIMARY KEY,
student_id INTEGER,
time_stamp DATETIME

};

CREATE TABLE marks {
id INTEGER PRIMARY KEY,
student_id INTEGER,
lab_id INTEGER,
mark FLOAT

};

INSERT INTO students (student_id, name, num_group) VALUES
(1,'Алексеев Алексей', 303),
(2,'Ашрятова Римма', 303),
(3,'Борисов Александр', 303),
(4,'Гарин Максим', 303),
(5,'Головатюк Анастасия', 303),
(6,'Горбунов Андрей', 303),
(7,'Гуськов Артем', 303),
(8,'Дворянинова Дарья', 303),
(9,'Еделева Юлия', 303),
(10,'Зевайкин Андрей', 303),
(11,'Исоков Асадбек', 303),
(12,'Казакова Ирина', 303),
(13,'Квашнин Кирилл', 303),
(14,'Кирдюшкин Данила', 303),
(15,'Козина Светлана', 303),
(16,'Козлова Екатерина', 303),
(17,'Котков Сергей', 303),
(18,'Ландышев Александр', 303),
(19,'Логинов Виталий', 303),
(20,'Малов Кирилл', 303),
(21,'Манин Данила', 303),
(22,'Маслова Елена', 303),
(23,'Паршин Артем', 303),
(24,'Пузин Владислав', 303),
(25,'Сайфетдинов Салават', 303),
(26,'Симатов Вадим', 303),

(27,'Александров К.В.', 402),
(28,'Антонов К.Ю.', 402),
(29,'Арянов В.А.', 402),
(30,'Ахунзада Г.А.', 402),
(31,'Балашов В.В.', 402),
(32,'Бикмаев Р.Р.', 402),
(33,'Булатова Г.Р.', 402),
(34,'Гераськин В.М.', 402),
(35,'Гурьков Н.Д.', 402),
(36,'Дурнаев Н.С.', 402),
(37,'Егоров О.А.', 402),
(38,'Кокулов А.Ф.', 402),
(39,'Кудашкин А.Е.', 402),
(40,'Лихорадов И.И.', 402),
(41,'Логинов А.Д.', 402),
(42,'Ломайкин А.С.', 402),
(43,'Макушев В.А.', 402),
(44,'Макшев Н.И.', 402),
(45,'Матвеев М.Д.', 402),
(46, 'Парамонов О.Н.', 402),
(47,'Плаксин Д.В.', 402),
(48,'Сазонов А.В.', 402),
(49,'Седики Х.Ю.', 402),
(50,'Сюсин А.В.', 402),
(51,'Тростин С.А.', 402),
(52,'Шабарин И.А.', 402);





INSERT INTO labs (name_lab, max_mark, num_group, dedline) VALUES
('1', 5, 303, '2021-02-06'),
('2', 5, 303, '2021-02-20'),
('3', 5, 303, '2021-02-27'),
('4', 6, 303, '2021-03-13'),
('5', 6, 303, '2021-03-27'),
('6', 8, 303, '2021-04-10'),
('7', 8, 303, '2021-04-24'),
('к/р', 6, 303, '2021-04-17'),
('8', 6, 303, '2021-05-01'),
('9', 5, 303, '2021-05-22'),
('10', 5, 303, '2021-06-02'),

('1', 8, 402, '2021-02-06'),
('2', 8, 402, '2021-02-13'),
('3', 9, 402, '2021-02-27'),
('4', 12, 402, '2021-03-13'),
('5', 12, 402, '2021-03-27'),
('6', 12, 402, '2021-04-10'),
('7', 9, 402, '2021-04-17');

INSERT INTO attendance (time_stamp, student_id) VALUES
( '2021-03-01 09:00:20',48 ),
('2021-03-05 18:01:58' ,46),
('2021-03-05 18:04:10', 33), 
('2021-03-05 18:04:16',28),
('2021-03-05 18:04:33', 27),
('2021-03-05 18:06:54',48 ),
('2021-03-05 18:07:02', 29);


